$( document ).ready(function() {
    var quote = new Array();
        quote[0] = "1.44a<br> ལས་རྣམས་བསྐལ་པ་བརྒྱར་ཡང་ནི། །ཆུད་མི་ཟ་བའང་ཚོགས་དང་དུས། ། རྙེད་ན་ལུས་ཅན་རྣམས་ལ་ནི། །འབྲས་བུ་དག་ཏུ་འགྱུར་བ་ཉིད། །";
        quote[1] = "1.95b<br> བརྩམ་པར་བྱ་ཞིང་འབྱུང་བར་བྱ།　།སངས་རྒྱས་བསྟན་ལ་འཇུག་པར་བྱ།　།　འདམ་བུའི་ཁྱིམ་ལ་གླང་ཆེན་བཞིན།　།འཆི་བདག་སྡེ་ནི་གཞོམ་པར་བྱ།　།　གང་ཞིག་རབ་ཏུ་བག་ཡོད་པར།　།ཆོས་འདུལ་འདི་ལ་སྤྱོད་འགྱུར་བ།　།　སྐྱེ་བའི་འཁོར་བ་རབ་སྤངས་ནས།　།སྡུག་བསྔལ་ཐ་མར་བྱེད་པར་འགྱུར།　།";
        quote[2] = "1.26a<br> བསགས་པ་ཀུན་གྱི་མཐའ་ཟད་ཅིང་།　།མཐོན་པོ་རྣམས་ཀྱི་མཐའ་ལྟུང་འགྱུར།　།　ཕྲད་པའི་མཐའ་ནི་འབྲལ་བ་སྟེ།　།གསོན་པའི་མཐའ་ནི་འཆི་བ་ཡིན།　།";
        quote[3] = "5.268b<br>  རི་རྒྱལ་ཡུངས་ཀར་གཉིས་ལ་ཁྱད་པར་གང་ཡོད་དང།　།དུག་ཅན་གླང་རྗེས་ཆུ་ལ་ཁྱད་པར་གང་ཡོད་དང།　།ཉི་མ་མེ་ཁྱེར་སྲིན་ལ་ཁྱད་པར་གང་ཡོད་པ།　།ནམ་མཁའ་པད་མའི་བུ་གར་ཁྱད་པར་གང་ཡོད་པ།　།སངས་རྒྱས་ཉན་ཐོས་བྱང་ཆུབ་ཁྱད་པར་དེ་ཡོད་དོ།　།";
        quote[4] = "6.73b<br> གང་ཚེ་ཁྱོད་བལྟམས་དོག་ས་རབ་གཡོས་དང་།　།འཛམ་བུའི་གྲིབ་མས་ཁྱོད་སྐུ་མ་བཏང་དང་།　།　འདི་དང་ལན་གསུམ་ཀུན་གཟིགས་མཁྱེན་ལྡན་པ།　།སངས་རྒྱས་ཁྱོད་ཀྱི་ཞབས་ལ་བདག་ཕྱག་འཚལ།　།";
        quote[5] = "6.93b<br> གང་ལས་སྡུག་བསྔལ་སྐྱེ་འགྱུར་བའི།　།བདེ་བ་དེ་ལ་བདེར་མི་སེམས།　།　གང་ལས་བདེ་བ་སྐྱེ་འགྱུར་བའི།　།སྡུག་བསྔལ་དེ་ལ་བདེ་བར་སེམས།　།";
        quote[6] = "7.88b<br> གང་ཕྱིར་བྱ་བ་ཐམས་ཅད་ལ།　།སྐྱེས་པ་འབའ་ཤིག་མཁས་པ་མིན།　།　དེ་དང་དེ་ལ་བུད་མེད་ཀྱང་།　།ཟིན་ལ་མཁས་པ་ཉིད་དུ་འགྱུར།　།";
        quote[7] = "8.97b<br> ཁོ་བོ་ཆོས་ལ་གནས་ན་མྱུར་དུ་ཤི་ཡང་བླ།　།ཆོས་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་ན་གསོན་པར་མ་གྱུར་ཅིག　།　ཆོས་ལ་གནས་པ་སུམ་བཅུ་ལྷ་ཡི་བདེ་བ་སྤྱོད།　།ཆོས་ལས་ཉམས་པ་མི་བཟད་འཇིགས་པའི་ངན་སོང་ལྟུང་།　།";
        quote[8] = "9.97a<br> སེམས་ཅན་ཀུན་ལ་སྦྱིན་པ་དང།　།སེམས་ཅན་གཅིག་ལ་སྙིང་བརྩེ་གང།　།སེམས་ཅན་ཀུན་ལ་སྦྱིན་པ་བས།　།སྙིང་བརྩེ་གཅིག་ཏུ་ཁྱད་པར་འཕགས།　།";
        quote[9] = "36.176a<br> ཆུ་ཡི་ཐིགས་པས་བུམ་པ་དང་པོ་ཐ་མའི་བར།　།རིམ་གྱིས་ཉུང་ངུ་ཉུང་ངུས་དེ་ཡོངས་འགེངས་པ་ལྟར།　།　དེ་བཞིན་དང་པོའི་སེམས་ཀྱང་བྱང་ཆུབ་མཆོག་རྒྱུ་སྟེ།　།རིམ་གྱིས་དཀར་པོའི་ཡོན་ཏན་རྫོགས་པའི་སངས་རྒྱས་འགྱུར།　།";
        quote[10] = "39.10b<br> སངས་རྒྱས་ཐེག་པ་འདི་ལ་ངེས་པར་འབྱུང་འདོད་གང་།　།འགྲོ་བ་ཀུན་ལ་སེམས་སྙོམས་ཕ་མའི་འདུ་ཤེས་དང་།　།　ཕན་པའི་སེམས་དང་བྱམས་པའི་ཡིད་ཀྱིས་བརྟུལ་བྱ་ཞིང་།　།ཐ་བ་མེད་ཅིང་དྲང་ལ་ཚིག་འཇམ་སྨྲ་བར་བྱ།　།";
        quote[11] = "44.9b<br> འདུ་བྱེད་ཁམས་དང་དོན་དམ་མཚན་ཉིད་ནི།　།གཅིག་དང་ཐ་དད་བྲལ་བའི་མཚན་ཉིད་དེ།　།　གཅིག་དང་ཐ་དད་དུ་ཡང་གང་རྟོག་པ།　།དེ་དག་ཚུལ་བཞིན་མ་ཡིན་ཞུགས་པ་ཡིན།　།སྐྱེ་བ་པོ་ཡི་ལྷག་མཐོང་དང་།　།ཞི་གནས་གོམས་པར་བྱས་ནས་ནི།　།གནས་ངན་ལེན་གྱི་འཆིང་བ་དང་།　།མཚན་མའི་འཆིང་ལས་རྣམ་གྲོལ་འགྱུར།　";
        quote[12] = "44.9b<br> འདུ་བྱེད་ཁམས་དང་དོན་དམ་མཚན་ཉིད་ནི།　།གཅིག་དང་ཐ་དད་བྲལ་བའི་མཚན་ཉིད་དེ།　།　གཅིག་དང་ཐ་དད་དུ་ཡང་གང་རྟོག་པ།　།དེ་དག་ཚུལ་བཞིན་མ་ཡིན་ཞུགས་པ་ཡིན།　།སྐྱེ་བ་པོ་ཡི་ལྷག་མཐོང་དང་།　།ཞི་གནས་གོམས་པར་བྱས་ནས་ནི།　།གནས་ངན་ལེན་གྱི་འཆིང་བ་དང་།　།མཚན་མའི་འཆིང་ལས་རྣམ་གྲོལ་འགྱུར།　";
        quote[13] = "44.14a<br> ལེན་པའི་རྣམ་པར་ཤེས་པ་ཟབ་ཅིང་ཕྲ།　།ས་བོན་ཐམས་ཅད་ཆུ་བོའི་ཀླུང་ལྟར་འབབ།　།　བདག་ཏུ་རྟོག་པར་གྱུར་ན་མི་རུང་ཞེས།　།བྱིས་པ་རྣམས་ལ་ངས་ནི་དེ་མ་བསྟན།　།";
        quote[14] = "44.16a<br> མཚན་ཉིད་མེད་པའི་ཆོས་ནི་རབ་ཤེས་ན།　།ཀུན་ནས་ཉོན་མོངས་མཚན་ཉིད་ཆོས་སྤོང་འགྱུར།　།　ཀུན་ནས་ཉོན་མོངས་ཆོས་ནི་རབ་སྤངས་ན།　།ཤིན་དུ་རྣམ་དག་མཚན་ཉིད་ཆོས་ཐོབ་འགྱུར།　།　སྐྱེ་བོ་བག་མེད་ཉེས་བཅོམ་ལེ་ལོ་ཅན།　།འདུ་བྱེད་སྐྱོན་ལ་རྟོག་པར་མི་བྱེད་པ།　།　བརྟན་མེད་གཡོ་བ་ཡོད་པའི་ཆོས་རྣམས་ལ།　།རབ་ཏུ་ཉམས་པས་སྙིང་བརྩེར་བྱ་བ་ཡིན།　།";
        quote[15] = "44.310a<br> འཇམ་དཔལ་འདི་ལྟ་སྟེ།　དཔེར་ན་ཆུ་ཀླུང་མིང་ཐ་དད་པ་དང་།　ཁ་དོག་ཐ་དད་པ་དང་།　རོ་ཐ་དད་པ་རྒྱ་མཚོའི་ནང་དུ་བབ་པ་རྣམས་ལ་ནི་འདི་ལྟ་སྟེ།　འདི་ནི་གང་གཱའོ་ཞེའམ་སི་ཏའོ་ཞེའམ།　།　ཡ་མུ་ནའོ་ཞེས་བྱེ་བྲག་ཏུ་དབྱེ་བའམ་ཐ་དད་དུ་བྱར་མི་ནུས་སོ།　།འཇམ་དཔལ་དེ་བཞིན་དུ་མིང་ཐ་དད་པའི་ཆོས་རྣམས་ཀྱང་ཆོས་ཀྱི་དབྱིངས་ལ་འདི་ནི་སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་སོ་ཞེ་འམ།　ཉན་ཐོས་དང་།　རང་སངས་རྒྱས་དང་།　བྱང་ཆུབ་སེམས་དཔའ་དང་།　སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་སོ་ཞེས་ཐ་དད་པར་གདགས་པར་མི་ནུས་སོ།　།";
        quote[16] = "47.54b<br> གང་ཚུལ་ཁྲིམས་ལྔ་སྲུང་བ་ཙམ་གྱིས་ཐེག་པ་ཆེན་པོའི་གང་ཟག་ཅེས་མི་བྱའི།　ཚུལ་ཁྲིམས་ལྔ་མ་བསྲུངས་པའི་དམ་པའི་ཆོས་སྲུང་ན་ཐེག་པ་ཆེན་པོ་ཞེས་བྱའོ།།";
        quote[17] = "56.172a<br> དེ་བཞིན་གཤེགས་ལ་ཕྱག་འཚལ་ནས།　།དམ་པའི་ཆོས་ནི་མཉན་པ་དང་།　།མཆོད་ཅིང་འཛིན་པ་འང་དེ་བཞིན་ཏེ།　།སྡུག་བསྔལ་ཀུན་ལས་གྲོལ་བར་འགྱུར།　།";
        quote[18] = "59.72b<br> དེ་བཞིན་གཤེགས་ལ་ཕྱག་འཚལ་ནས།　།དམ་པའི་ཆོས་ནི་མཉན་པ་དང་།　།མཆོད་ཅིང་འཛིན་པ་འང་དེ་བཞིན་ཏེ།　།སྡུག་བསྔལ་ཀུན་ལས་གྲོལ་བར་འགྱུར།　།";
        quote[19] = "79.192a<br> དད་པ་མེད་པའི་མི་ལ་ནི།　།དཀར་པོའི་ཆོས་རྣམས་མི་སྐྱེ་སྟེ།　།མེ་ཡིས་ས་བོན་ཚིག་རྣམས་ལ།　།མྱུ་གུ་སྔོན་པོ་ཇི་བཞིན་ནོ།　།";
        quote[20] = "87.76b<br> བླ་མ་དམ་པ་རྟག་ཏུ་བསྟེན།　།ཐེག་ཆེན་ཟབ་མོའི་མདོ་རྒྱུད་བལྟ།　།　བསྒོམ་དུ་མེད་པའི་དོན་བསྒོམས་ན།　།མ་བསྒོམས་ན་ཡང་བསྒོམ་པའི་མཆོག　།　དེ་ལྟར་གྱུར་པའི་མཁས་པ་ལ།　།སྟོང་པར་མི་འགྱུར་གང་ཡང་མེད།　།　དེ་ལས་མྱ་ངན་འདས་པ་འབྱུང་།　།སྐུ་དང་སྟོབས་ལ་སོགས་པ་ཀུན།　།　ནོར་བུའི་ཚུལ་དུ་རང་བཞིན་འབྱུང་།　།དེ་དག་སེམས་ཀྱི་ཕན་ཡོན་ནོ།　།";
        quote[21] = "5.23a<br> སྡིག་པ་ཐམས་ཅད་མི་བྱ་སྟེ། །དགེ་བ་ཕུན་སུམ་ཚོགས་པར་བྱ། །རང་གི་སེམས་ནི་ཡོངས་སུ་གདུལ། །འདི་ནི་སངས་རྒྱས་བསྟན་པ་ཡིན།།";
        quote[22] = "40.18a<br> གང་གིས་བསྐལ་པ་བྱེ་བ་སྟོང་ཚང་བར། །སེམས་ཅན་ཀུན་ལ་བདེ་བ་བྱིན་པ་བས། ། ལ་ལས་བྱང་ཆུབ་མཆོག་སེམས་གཅིག་བསྐྱེད་པ། །དེ་ཡི་བསོད་ནམས་དཔེར་ཡང་བཟོད་མི་འགྱུར།།";
        quote[23] = "40.18a<br> ཤིན་དུ་མང་པོར་སྨྲ་བ་ཅི་དགོས་ཏེ། །དོན་དང་ཡང་དག་ལྡན་པའི་ཆོས་དེ་ལ། །<br>ཁྱེད་ཅག་གནས་པར་བྱས་པར་མ་གྱུར་ན། །དེ་ལ་ཆོས་ཀྱིས་ལན་པ་མ་ཡིན་ནོ།།";
        quote[24] = "41.26a<br> ཤིན་དུ་མང་པོར་སྨྲ་བ་ཅི་དགོས་ཏེ། །དོན་དང་ཡང་དག་ལྡན་པའི་ཆོས་དེ་ལ། །<br>ཁྱེད་ཅག་གནས་པར་བྱས་པར་མ་གྱུར་ན། །དེ་ལ་ཆོས་ཀྱིས་ལན་པ་མ་ཡིན་ནོ།།";
        quote[25] = "44.78a<br> ཇི་ལྟར་ཉི་མའི་འོད་ཟེར་དང་། །རྒྱ་མཚོ་ཡི་ནི་དབའ་རླབས་དག །མི་གཅིག་ཐ་དད་མིན་པར་ཤེས། །དེ་བཞིན་རྣམ་ཤེས་བདུན་པོ་ཡང་། །སེམས་དང་ལྷན་ཅིག་ལྡན་པའོ། །";
        quote[26] = "49.102b<br> སངས་རྒྱས་ཆོས་དང་དགེ་འདུན་རྣམས། །ང་ཡི་ཁམས་ཀྱི་རང་བཞིན་ཏེ། །གསུམ་པོ་རིན་ཆེན་མཆོག་ཡིན་ཞེས། །བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་བཅད་གསུངས། །";
        quote[27] = "50.259b<br> གང་ཆོས་མ་བྱུང་སུས་ཀྱང་བྱས་མ་ཡིན། །རང་གི་ཤེས་པས་དེ་དག་དེ་ལ་རྟོག ། <br>སྟོང་ཉིད་མ་སྐྱེས་སུས་ཀྱང་བྱས་མ་ཡིན། །མ་མཐོང་འོངས་པ་མ་ཡིན་འཕོ་མིན་ན། །<br>དམིགས་གནས་བདག་ཅག་སྟོང་ཉིད་ལེགས་བསླབ་ཤེས། །འཛེར་པ་དེ་དག་ཆོས་ཀྱི་རྐུན་པོ་ཡིན།།";
        quote[28] = "49.149a<br> སེམས་ནི་ཡེ་ཤེས་འབྱུང་བའི་རྒྱུ། །སངས་རྒྱས་གཞན་དུ་མ་ཚོལ་ཅིག །";


        index = Math.floor(Math.random() * quote.length);
        $("#textBox").append(quote[index]);

        var uti = (quote[index].split("<br>"))[0];
        localStorage.setItem("DailyUti",uti);
        console.log("DailyUti:"+uti);
});
